snlkuharlocal/src/DataProcessors/ВыборБригады/ВыборБригады.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>ВыборБригады</name>
</mdclass:DataProcessor>

snlkuharlocal/src/InformationRegisters/ТекущиеБригады/ТекущиеБригады.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ТекущиеБригады</name>
  <attributes>
    <name>ДатаЗаписи</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ВедущийСотрудник</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <dimensions>
    <name>РабочееМесто</name>
    <type>
      <types>CatalogRef.РабочиеМеста</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Сотрудник</name>
    <type>
      <types>CatalogRef.ФизическиеЛица</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

snlkuharlocal/src/DataProcessors/ВыборБригады/Forms/ФормаВыбораБригады/Module.bsl
&НаКлиенте
Процедура Очистить(Команда)
	
	ОбновитьТекущуюБригаду();
		
	ЗаполнитьТекущуюБригаду();
	
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	РабочееМесто = ПараметрыСеанса.РабочееМестоКлиента;
	
	Сканировщик = ПараметрыСеанса.Пользователь;
	ФизЛицо = Сканировщик.ФизЛицо;
		
	ЗаполнитьТекущуюБригаду();
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьТекущуюБригаду()
	
	Бригада.Очистить();	

	// Кельманов А.В. - ИЗМ-0000000062 - 2026.06.26 {
	//Бригада.Загрузить(ТекущаяБригада());
	Бригада.Загрузить(ТекущаяБригада(Ложь));
	// Кельманов А.В. - ИЗМ-0000000062 - 2026.06.26 }
	
КонецПроцедуры

&НаКлиенте
Процедура ВнешнееСобытие(Источник, Событие, Данные)
	
	Если Не ВводДоступен() Тогда 
		Возврат; 
	КонецЕсли;
	
	Если Не ЭтоСобытиеСканера(Событие) Тогда 
		Возврат; 
	КонецЕсли;
	
	Если СтрДлина(Данные) = 13 И Лев(Данные, 3) = "777" Тогда
		
		ДобавляемоеФизЛицо = Справочники.ФизическиеЛица.НайтиПоРеквизиту("ШтрихКод", СокрЛП(Данные));		
		
		Если ЗначениеЗаполнено(ДобавляемоеФизЛицо) Тогда
			
			ТекстОшибки = "";
			
			ПроверитьДобавитьСотрудника(ДобавляемоеФизЛицо, ТекстОшибки);
			
			Если ЗначениеЗаполнено(ТекстОшибки) Тогда
				
				Сообщить(ТекстОшибки);
				
			КонецЕсли;
			
		Иначе
			
			Сообщить("Не удалось определить сотрудника по ШК");
			
		КонецЕсли;
		
	Иначе
		
		Сообщить("Некорректный ШК для определения сотрудника");
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура Удалить(Команда)
	
	УдалитьНаСервере();
	
	ЗаполнитьТекущуюБригаду();
	
КонецПроцедуры 

&НаСервере
Процедура УдалитьНаСервере()
	
	МассСтрок = Бригада.НайтиСтроки(Новый Структура("Выбрать", Истина));
	
	Для Каждого Стр Из МассСтрок Цикл
		
		Если Стр.Сотрудник <> ФизЛицо Тогда
			
			Запись = РегистрыСведений.ТекущиеБригады.СоздатьМенеджерЗаписи();
			Запись.РабочееМесто = РабочееМесто;
			Запись.Сотрудник = Стр.Сотрудник;
			Запись.Удалить();
			
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура ПроверитьДобавитьСотрудника(ДобавляемоеФизЛицо, ТекстОшибки = "")
	
	МассСтрок = Бригада.НайтиСтроки(Новый Структура("Сотрудник", ДобавляемоеФизЛицо));
	
	Если МассСтрок.Количество() <> 0 Тогда
		
		ТекстОшибки = "Сотрудник " + ДобавляемоеФизЛицо + " уже в составе бригады";
		
	Иначе
		
		Запись = РегистрыСведений.ТекущиеБригады.СоздатьМенеджерЗаписи();
		Запись.РабочееМесто = РабочееМесто;
		Запись.Сотрудник = ДобавляемоеФизЛицо;
		Запись.ДатаЗаписи = ТекущаяДата();
		
		// Кельманов А.В. - ИЗМ-0000000062 - 2026.06.26 {
		Если Бригада.Количество() = 0 Тогда
			
			Запись.ВедущийСотрудник = Истина;
			
		КонецЕсли;
		// Кельманов А.В. - ИЗМ-0000000062 - 2026.06.26 }
		
		Запись.Записать();
		
		НовСтр = Бригада.Добавить();
		НовСтр.Сотрудник = ДобавляемоеФизЛицо;
		
		Элементы.Бригада.ТекущаяСтрока = НовСтр.ПолучитьИдентификатор();
			
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ИмитацияСканированияПриИзменении(Элемент)
	
	ВнешнееСобытие(Неопределено, "BarCodeValue", ИмитацияСканирования); 
	
	ИмитацияСканирования = "";

КонецПроцедуры
